//蓦然雪化, 且静候, 飞雪再临之时。
//
//题目描述
//天津迎来了久违的大雪！在《White Album》的旋律中，Siannodel和鱼灰开始了校园内一条街道的扫雪工作。
//
//整条街道长度为，Siannodel和鱼灰各自有一个起始位置和恒定的速度，记为、和、.
//
//他们可以在这段路上以任何路线进行扫雪工作，而只要其中一个人经过街道的某一位置，就可以扫清该位置上的积雪，当然，两个人可以先后经过同一位置，但也不会有额外的收获。
//
//现在，请你为他们规划一个最佳的扫雪方案，使得扫清整条街道所有积雪的时间最短。
//
//输入
//本题有多组样例。
//
//第一行输入一个实数，代表样例组数。
//
//接下来的行，每行输入五个数字：、、、、。
//
//输出
//对于每个样例输出一行，包含一个数字，代表扫清积雪的最短时间。
//
//若你的答案的绝对误差或相对误差不超过，则被认为正确，因此请保留较多的小数位数。
//
//样例输入
//2
//10000.0 1.0 0.001 9999.0 0.001
//4306.063 4079.874 0.607 1033.423 0.847
//样例输出
//5001000.0000000000
//3827.8370013755